; domain
(define (domain emergency)

(:requirements :strips :typing)

(:types
location                    ; where person, robot, box and content can be
person                      ; person in need of help, is at a specific location
robot                       ; carries boxes to person, can move btw locations
box                         ; containts emergency supplies
food medicine tool - supply ; supplies to be brought to people
)

(:constants 
depot - location)

(:predicates
(patl ?p - person ?l - location)        ; person ?p is at location ?l
(ratl ?r - robot ?l - location)         ; robot ?r is at location ?l
(batl ?b - box ?l - location)           ; box ?b is at location ?l
(satl ?s - supply ?l - location)        ; supply ?s is at location ?l

(loaded ?r - robot ?b - box)             ; robot ?r has box ?b
(unloaded ?r - robot)                   ; robot ?r is empty

(contain ?b - box ?s - supply)          ; box ?b contains supply ?s
(empty ?b - box)                        ; box ?b is empty

(have ?p - person ?s - supply)          ; person ?p has supply ?s
)


; actions

; move robot btw locations
(:action move
    :parameters (?r - robot ?from ?to - location)
    :precondition (and (ratl ?r ?from))
    :effect (and (ratl ?r ?to) (not (ratl ?r ?from)))
)

; robot loads a box if robot and box are in the same location
(:action load
    :parameters (?r - robot ?l - location ?b - box)
    :precondition (and (unloaded ?r) (ratl ?r ?l) (batl ?b ?l))
    :effect (and (loaded ?r ?b) (not (unloaded ?r)) (not (batl ?b ?l)))
)

; robot unloads a box at some location
(:action unload
    :parameters (?r - robot ?b - box ?l - location)
    :precondition (and (ratl ?r ?l) (loaded ?r ?b))
    :effect (and (unloaded ?r) (not (loaded ?r ?b)) (batl ?b ?l))
)

; fill a box with a content, if the box is empty and the supply, the box and the agent are at the same location;
(:action fill
    :parameters (?r - robot ?l - location ?b - box ?s - supply)
    :precondition (and (empty ?b) (ratl ?r ?l) (batl ?b ?l) (satl ?s ?l))
    :effect (and (contain ?b ?s) (not (empty ?b)))
)

; empty a box by leaving the content to the current location, and causing the people at the same location to have the content
(:action give
    :parameters (?r - robot ?l - location ?b - box ?s - supply ?p - person)
    :precondition (and (ratl ?r ?l) (batl ?b ?l) (contain ?b ?s) (patl ?p ?l))
    :effect (and (have ?p ?s) (empty ?b) (not (contain ?b ?s)))
)


)

; problem
(define (problem part1) (:domain emergency)
(:objects
 l1 l2 l3 - location
 p1 p2 p3 - person 
 r1 - robot
 b1 b2 b3 b4 - box
 f - food
 m - medicine
 t - tool

)

(:init
    ; robot, boxes and supply are at the same location (depot)
    (ratl r1 depot)
    (batl b1 depot)
    (satl f depot)
    (satl m depot)
    (satl t depot)

    ; robot and box are empty
    (unloaded r1)
    (empty b1)

    ; location of people
    (patl p1 l2)
    (patl p2 l2)
    (patl p3 l3)

)

(:goal (and
    (have p1 f)
    (have p2 f)
    (have p2 t)
    (have p3 m)
))

)

; plan
1. (fill r1 depot b1 f)
   deleted: (empty b1)
   added: (contain b1 f)
   goals met: 0 of 4
2. (load r1 depot b1)
   deleted: (unloaded r1) (batl b1 depot)
   added: (loaded r1 b1)
   goals met: 0 of 4
3. (move r1 depot l2)
   deleted: (ratl r1 depot)
   added: (ratl r1 l2)
   goals met: 0 of 4
4. (unload r1 b1 l2)
   deleted: (loaded r1 b1)
   added: (unloaded r1) (batl b1 l2)
   goals met: 0 of 4
5. (give r1 l2 b1 f p1)
   deleted: (contain b1 f)
   added: (have p1 f) (empty b1)
   goals met: 1 of 4
6. (load r1 l2 b1)
   deleted: (unloaded r1) (batl b1 l2)
   added: (loaded r1 b1)
   goals met: 1 of 4
7. (move r1 l2 depot)
   deleted: (ratl r1 l2)
   added: (ratl r1 depot)
   goals met: 1 of 4
8. (unload r1 b1 depot)
   deleted: (loaded r1 b1)
   added: (unloaded r1) (batl b1 depot)
   goals met: 1 of 4
9. (fill r1 depot b1 m)
   deleted: (empty b1)
   added: (contain b1 m)
   goals met: 1 of 4
10. (load r1 depot b1)
   deleted: (unloaded r1) (batl b1 depot)
   added: (loaded r1 b1)
   goals met: 1 of 4
11. (move r1 depot l3)
   deleted: (ratl r1 depot)
   added: (ratl r1 l3)
   goals met: 1 of 4
12. (unload r1 b1 l3)
   deleted: (loaded r1 b1)
   added: (unloaded r1) (batl b1 l3)
   goals met: 1 of 4
13. (give r1 l3 b1 m p3)
   deleted: (contain b1 m)
   added: (have p3 m) (empty b1)
   goals met: 2 of 4
14. (load r1 l3 b1)
   deleted: (unloaded r1) (batl b1 l3)
   added: (loaded r1 b1)
   goals met: 2 of 4
15. (move r1 l3 depot)
   deleted: (ratl r1 l3)
   added: (ratl r1 depot)
   goals met: 2 of 4
16. (unload r1 b1 depot)
   deleted: (loaded r1 b1)
   added: (unloaded r1) (batl b1 depot)
   goals met: 2 of 4
17. (fill r1 depot b1 t)
   deleted: (empty b1)
   added: (contain b1 t)
   goals met: 2 of 4
18. (load r1 depot b1)
   deleted: (unloaded r1) (batl b1 depot)
   added: (loaded r1 b1)
   goals met: 2 of 4
19. (move r1 depot l2)
   deleted: (ratl r1 depot)
   added: (ratl r1 l2)
   goals met: 2 of 4
20. (unload r1 b1 l2)
   deleted: (loaded r1 b1)
   added: (unloaded r1) (batl b1 l2)
   goals met: 2 of 4
21. (give r1 l2 b1 t p2)
   deleted: (contain b1 t)
   added: (have p2 t) (empty b1)
   goals met: 3 of 4
22. (load r1 l2 b1)
   deleted: (unloaded r1) (batl b1 l2)
   added: (loaded r1 b1)
   goals met: 3 of 4
23. (move r1 l2 depot)
   deleted: (ratl r1 l2)
   added: (ratl r1 depot)
   goals met: 3 of 4
24. (unload r1 b1 depot)
   deleted: (loaded r1 b1)
   added: (unloaded r1) (batl b1 depot)
   goals met: 3 of 4
25. (fill r1 depot b1 f)
   deleted: (empty b1)
   added: (contain b1 f)
   goals met: 3 of 4
26. (load r1 depot b1)
   deleted: (unloaded r1) (batl b1 depot)
   added: (loaded r1 b1)
   goals met: 3 of 4
27. (move r1 depot l2)
   deleted: (ratl r1 depot)
   added: (ratl r1 l2)
   goals met: 3 of 4
28. (unload r1 b1 l2)
   deleted: (loaded r1 b1)
   added: (unloaded r1) (batl b1 l2)
   goals met: 3 of 4
29. (give r1 l2 b1 f p2)
   deleted: (contain b1 f)
   added: (have p2 f) (empty b1)
   goals met: 4 of 4
